<template>
  <div>
    <div
      v-for="item in list" :key="item.id"
      style="margin: 15px 0;"
    >
      <card
        v-bind="item"
        @add-to-basket="onClick('add-to-basket', $event)"
        @add-to-favorite="onClick('add-to-favorite', $event)"
        @remove-from-favorite="onClick('remove-from-favorite', $event)"
        @pay="onClick('pay', $event)"
      />
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      list: [
        {
          id: 1,
          img: 'https://picsum.photos/256/256?1',
          supheader: 'Разовая продажа',
          header: 'Пиломатериалы брус доска',
          address: 'Санкт-Петербург, Красное Село',
          seller: 'Торговый Дом ГОСТ',
          goodsType: 'Стройматериалы',
          description: `
          Пиломатериалы брус доска. Распродажа пиломатериалов в связи закрытием ЛЕСО-БАЗЫ!
            Успейте приобрести пиломатериал со скидками до закрытия 01.06.2022 !
            Мы стараемся быть не такими как все и даем вам: Доставка в согласованный день, если переносим - доставка бесплатно за наш счет.
            Весь материал соответствует гостам. Вы можете проверить пиломатериалы на складе или на адресе. Если материал не соответствует заявленному качеству - бесплатно меняем его.
          `,
          price: 33000,
          quantity: 3,
          priceForUnit: 11000,
          favorite: false,
          paid: false,
        },
        {
          id: 2,
          img: 'https://picsum.photos/256/256?2',
          supheader: 'Разовая продажа',
          header: 'Пиломатериалы брус доска',
          address: 'Санкт-Петербург, Красное Село',
          seller: 'Торговый Дом ГОСТ',
          goodsType: 'Стройматериалы',
          description: `
          Пиломатериалы брус доска. Распродажа пиломатериалов в связи закрытием ЛЕСО-БАЗЫ!
            Успейте приобрести пиломатериал со скидками до закрытия 01.06.2022 !
            Мы стараемся быть не такими как все и даем вам: Доставка в согласованный день, если переносим - доставка бесплатно за наш счет.
            Весь материал соответствует гостам. Вы можете проверить пиломатериалы на складе или на адресе. Если материал не соответствует заявленному качеству - бесплатно меняем его.
          `,
          price: 33000,
          quantity: 3,
          priceForUnit: 11000,
          favorite: true,
          paid: false,
        },
        {
          id: 3,
          img: 'https://picsum.photos/256/256?3',
          supheader: 'Разовая продажа',
          header: 'Пиломатериалы брус доска',
          address: 'Санкт-Петербург, Красное Село',
          seller: 'Торговый Дом ГОСТ',
          goodsType: 'Стройматериалы',
          description: `
          Пиломатериалы брус доска. Распродажа пиломатериалов в связи закрытием ЛЕСО-БАЗЫ!
            Успейте приобрести пиломатериал со скидками до закрытия 01.06.2022 !
            Мы стараемся быть не такими как все и даем вам: Доставка в согласованный день, если переносим - доставка бесплатно за наш счет.
            Весь материал соответствует гостам. Вы можете проверить пиломатериалы на складе или на адресе. Если материал не соответствует заявленному качеству - бесплатно меняем его.
          `,
          price: 33000,
          quantity: 3,
          priceForUnit: 11000,
          favorite: true,
          paid: true,
        },
      ],
    }
  },
  methods: {
    onClick(type, id) {
      console.log('type', type);
      console.log('id', id);
    },
  },
}
</script>

<style>

</style>
